{"html":"","css":"","js":"","dataEditor":" [\n  {\n    id: 1,\n    title: \"New Sports Apparel Collection Launched\",\n    excerpt: \"Discover our latest sports apparel collection, made from sustainable materials and suitable for all seasons.\",\n    content: \"We are excited to present our latest sports apparel collection. This innovative line is the result of months of research and development, focusing on sustainability and comfort. The collection includes breathable shirts, flexible pants, and weather-resistant jackets, all made from recycled materials. Each garment has been tested by professional athletes to ensure optimal performance. The collection is now available in all stores and online.\",\n    category: \"important\",\n    date: \"23 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1576633587382-13ddf37b1fc1?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"thumbsup\", count: 12 },\n      { type: \"heart\", count: 8 }\n    ],\n    comments: [\n      {\n        author: \"Lisa from Marketing\",\n        text: \"Really proud of this collection! When will we receive the product photos for the social media campaign?\",\n        date: \"23 Feb 2024\"\n      },\n      {\n        author: \"Mark from Sports Department\",\n        text: \"Great that we're now using sustainable materials. Customers have been asking for this more and more!\",\n        date: \"23 Feb 2024\"\n      },\n      {\n        author: \"Sophie from Purchasing\",\n        text: \"I have some concerns about the delivery times for the new materials. Could we discuss this internally?\",\n        date: \"23 Feb 2024\",\n        isPrivate: true\n      },\n      {\n        author: \"John the Director\",\n        text: \"I understand your concerns Sophie. Let's meet tomorrow at 10:00 to discuss this. I've already been in contact with the suppliers.\",\n        date: \"23 Feb 2024\",\n        isAdmin: true,\n        isPrivate: true\n      }\n    ],\n    viewCount: 145,\n    potentialReaders: 200,\n    status: \"published\",\n    isHighPriority: true\n  },\n  {\n    id: 2,\n    title: \"Q4 2023 Quarterly Results\",\n    excerpt: \"An overview of our performance in the last quarter of 2023, focusing on growth and customer satisfaction.\",\n    content: \"The last quarter of 2023 was a period of significant growth for our company. We saw a 15% increase in revenue compared to the same period last year. Our customer satisfaction score rose to 4.8 out of 5, which is a new record. We opened three new stores and our online platform saw a 25% growth in visits. These results are due to your hard work and dedication. In 2024, we will continue to invest in staff training and development.\",\n    category: \"company\",\n    date: \"21 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1454165804606-c3d57bc86b40?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"thumbsup\", count: 24 },\n      { type: \"heart\", count: 15 },\n      { type: \"smile\", count: 5 }\n    ],\n    comments: [\n      {\n        author: \"Peter from Sales\",\n        text: \"Fantastic results! Particularly proud of the customer satisfaction score. The whole team worked hard for this.\",\n        date: \"21 Feb 2024\"\n      }\n    ],\n    viewCount: 198,\n    potentialReaders: 200,\n    status: \"published\"\n  },\n  {\n    id: 3,\n    title: \"Training: Customer Service Excellence\",\n    excerpt: \"New online training available about delivering exceptional customer service in our stores.\",\n    content: \"We are introducing a new online training module aimed at improving our customer service. This interactive course covers important topics such as recognizing customer needs, effective communication, and handling challenging situations. The training takes approximately 2 hours and can be completed at your own pace. Upon completion, you will receive a certificate. This training is mandatory for all store employees and must be completed by the end of March.\",\n    category: \"training\",\n    date: \"20 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1552581234-26160f608093?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"thumbsup\", count: 18 },\n      { type: \"smile\", count: 7 }\n    ],\n    comments: [\n      {\n        author: \"Emma from Rotterdam Store\",\n        text: \"Just completed the training. Very useful and practical. The section about handling difficult customer conversations was particularly interesting.\",\n        date: \"21 Feb 2024\"\n      }\n    ],\n    viewCount: 87,\n    potentialReaders: 150,\n    status: \"published\"\n  },\n  {\n    id: 4,\n    title: \"New Summer Collection: Beach Fashion 2024\",\n    excerpt: \"Check out our new beach fashion collection for the upcoming summer season, featuring trendy designs and sustainable materials.\",\n    content: \"Get ready for summer with our latest beach fashion collection! From stylish swimsuits to comfortable beach dresses, our new line combines the latest fashion trends with sustainable materials. The collection is inspired by the Mediterranean lifestyle and features vibrant prints and colors. All items are made from recycled polyester and organic cotton, aligning with our sustainability goals.\",\n    category: \"product\",\n    date: \"22 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1520006403909-838d6b92c22e?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"heart\", count: 25 },\n      { type: \"smile\", count: 12 }\n    ],\n    comments: [\n      {\n        author: \"Sarah from Purchasing\",\n        text: \"The initial customer reactions are very positive! The sustainable materials are particularly well received.\",\n        date: \"22 Feb 2024\"\n      }\n    ],\n    viewCount: 156,\n    potentialReaders: 200,\n    status: \"published\"\n  },\n  {\n    id: 5,\n    title: \"Sustainability Report 2023\",\n    excerpt: \"Discover how we reduced our environmental impact and achieved our sustainability goals in 2023.\",\n    content: \"We are proud to present our sustainability report for 2023. This year, we achieved important milestones in our journey towards more sustainable operations. We reduced our CO2 emissions by 30%, 75% of our packaging is now recyclable, and we established partnerships with sustainable suppliers. We also invested in solar panels for our distribution centers and switched to electric delivery vehicles.\",\n    category: \"company\",\n    date: \"19 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1542601906990-b4d3fb778b09?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"thumbsup\", count: 45 },\n      { type: \"heart\", count: 28 }\n    ],\n    comments: [\n      {\n        author: \"Thomas from Sustainability\",\n        text: \"A great year for our sustainability initiative. In 2024, we'll take it even further!\",\n        date: \"19 Feb 2024\"\n      }\n    ],\n    viewCount: 234,\n    potentialReaders: 250,\n    status: \"published\"\n  },\n  {\n    id: 6,\n    title: \"New E-learning: Digital Skills\",\n    excerpt: \"Start now with our new online course about essential digital skills for the modern workplace.\",\n    content: \"To support our employees in the digital transformation, we are launching a new e-learning module about digital skills. This course covers topics such as online collaboration, digital communication, cybersecurity, and the use of our new software systems. The training is set up interactively with practical examples and exercises. Upon completion, you will receive a digital certificate.\",\n    category: \"training\",\n    date: \"18 Feb 2024\",\n    imageUrl: \"https://images.unsplash.com/photo-1531482615713-2afd69097998?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80\",\n    reactions: [\n      { type: \"thumbsup\", count: 32 },\n      { type: \"smile\", count: 15 }\n    ],\n    comments: [\n      {\n        author: \"Linda from IT\",\n        text: \"Finally a comprehensive training that covers all important digital aspects. Recommended for everyone!\",\n        date: \"18 Feb 2024\"\n      }\n    ],\n    viewCount: 178,\n    potentialReaders: 200,\n    status: \"published\"\n  }\n]"}